alexvatti/embedded-documents/SoC-Validation/firmware/gpu_validation/gpu/gp/m400_gp_F123_vs_cmd0_check_0_b.c
/*----------------------------------------------------------------------------
*
* The confidential and proprietary information contained in this file may
* only be used by a person authorised under and to the extent permitted
* by a subsisting licensing agreement from ARM Limited.
*
*        (C) COPYRIGHT 2008-2009 ARM Limited.
*             ALL RIGHTS RESERVED
*             
* This entire notice must be reproduced on all copies of this file
* and copies of this file may only be made by a person if such person is
* permitted to do so under the terms of a subsisting license agreement
* from ARM Limited.
*
* Modified  : $Date: 2013/05/14 11:57:51 $
* Revision  : $Revision: 1.1 $
* Release   : $State: Exp $
*-----------------------------------------------------------------------------*/
#include "m400_gp_F123_vs_cmd0_check_0_b.h"
struct t_CheckData_m400_gp_F123_vs_cmd0_check_0_b __attribute__ ((section(".mali_data_check"))) CheckData_m400_gp_F123_vs_cmd0_check_0_b = {
/* unsigned int data_00004000[] = */
{
 0x00000000,0x00000001,0x00000002,0x00000003 /* 00004000 */
,0x00000004,0x00000005,0x00000006,0x00000007 /* 00004010 */
,0x00000008,0x00000009,0x0000000a,0x0000000b /* 00004020 */
,0x0000000c,0x0000000d,0x0000000e,0x0000000f /* 00004030 */
,0x00000010,0x00000011,0x00000012,0x00000013 /* 00004040 */
,0x00000014,0x00000015,0x00000016,0x00000017 /* 00004050 */
,0x00000018,0x00000019,0x0000001a,0x0000001b /* 00004060 */
,0x0000001c,0x0000001d,0x0000001f,0x0000001f /* 00004070 */
,0x00000000,0xffffffff,0xfffffffe,0xfffffffd /* 00004080 */
,0xfffffffc,0xfffffffb,0xfffffffa,0xfffffff9 /* 00004090 */
,0xfffffff8,0xfffffff7,0xfffffff6,0xfffffff5 /* 000040a0 */
,0xfffffff4,0xfffffff3,0xfffffff2,0xfffffff1 /* 000040b0 */
,0xfffffff0,0xffffffef,0xffffffee,0xffffffed /* 000040c0 */
,0xffffffec,0xffffffeb,0xffffffea,0xffffffe9 /* 000040d0 */
,0xffffffe8,0xffffffe7,0xffffffe6,0xffffffe5 /* 000040e0 */
,0xffffffe4,0xffffffe3,0xffffffe1,0xffffffe1 /* 000040f0 */
},
};

